12/data/attachments/203aa32c5bd1e22d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_e0f9dee1-0ec6-4b6c-b516-04b7e82d8ed8</nif:username>
            <nif:friendToBeAdded>Arthur_natural_Actions_84133_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>